CSI API ETABS v1

# cAnalyzeSetSolverOption Method

---

DEPRECATED. Please see SetSolverOption_2(Int32, Int32, Int32,
String) or
SetSolverOption_3(Int32, Int32, Int32, Int32, Int32,
String)

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetSolverOption(
    	int SolverType,
    	bool Force32BitSolver,
    	string StiffCase = ""
    )

    Function SetSolverOption (
    	SolverType As Integer,
    	Force32BitSolver As Boolean,
    	Optional StiffCase As String = ""
    ) As Integer

    Dim instance As cAnalyze
    Dim SolverType As Integer
    Dim Force32BitSolver As Boolean
    Dim StiffCase As String
    Dim returnValue As Integer

    returnValue = instance.SetSolverOption(SolverType,
    	Force32BitSolver, StiffCase)

    int SetSolverOption(
    	int SolverType,
    	bool Force32BitSolver,
    	String^ StiffCase = L""
    )

    abstract SetSolverOption :
            SolverType : int *
            Force32BitSolver : bool *
            ?StiffCase : string
    (* Defaults:
            let _StiffCase = defaultArg StiffCase ""
    *)
    -> int

#### Parameters

SolverType

    Type: SystemInt32

Force32BitSolver

    Type: SystemBoolean

StiffCase (Optional)

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cAnalyze Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com